cases/RDE_baseline/constant/reactions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
reactions
{
    H2Reaction
    {
        type     irreversibleArrhenius;
        reaction "H2 + 0.5O2 = H2O";
        A        1.8e12;
        beta     0;
        Ta       8354;
    }
}
