cases/RDE_baseline/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler; // Stable for highly transient detonation
}

gradSchemes
{
    default         Gauss linear; 
}

divSchemes
{
    default                 none;
    div(phi,U)              Gauss limitedLinearV 1;
    div(phi,h)              Gauss limitedLinear 1;
    div(phi,Yi_h)           Gauss limitedLinear 1;
    div(phi,K)              Gauss limitedLinear 1; // This is the one it just asked for
    div(phid,p)             Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

snGradSchemes
{
    default         corrected; // Essential for non-orthogonal RDE meshes
}

interpolationSchemes
{
    default         linear;
}