cases/RDE_baseline/system/residuals
type            residuals;
libs            ("libutilityFunctionObjects.so");
writeControl    timeStep;
writeInterval   20;
fields          (p rho);